app/controllers/freights_controller.rb

  def new
    power_generator = PowerGenerator.find(params[:id])
---
SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    power_generator = PowerGenerator.find(params[:freight][:power_generator_id])
---
SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]