app/controllers/power_generators_controller.rb

SELECT "power_generators".* FROM "power_generators" WHERE (power_generator.description = 'teste' OR power_generator.name = 'teste')
SELECT "power_generators".* FROM "power_generators"
SELECT COUNT(*) FROM "power_generators"
SELECT  "power_generators".* FROM "power_generators" LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    @power_generators = PowerGenerator.all
    @power_generators = PowerGenerator.order(params[:filter_power_generators]).search_for(params[:keyword]) if params[:keyword].present?
    @power_generators = advanced_query if params[:advanced_search_for_select].present?
    @power_generators = filter_power_generators(@power_generators)
    @power_generators = @power_generators.page params[:page] if @power_generators.present?

SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @power_generators = PowerGenerator.find(params[:id])

SELECT "power_generators".* FROM "power_generators" ORDER BY price
---
  def filter_power_generators(power_generators)
    return power_generators if params[:filter_power_generators].blank?

    power_generators.order(params[:filter_power_generators])